app/Controllers/Dashboard.php

    public function index()
    {
        // Balita
        $balitaQuery = $this->db->table('tb_data_balita2025_surobayan')
            ->select('COUNT(id) as total,
                      SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki,
                      SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan')
            ->get()->getRowArray();

        // Remaja Putri (hanya total perempuan)
        $remajaPutriQuery = $this->db->table('tb_data_remajaputri2025_surobayan')
            ->select('COUNT(id) as total')
            ->get()->getRowArray();
        $remajaPutriQuery['perempuan'] = $remajaPutriQuery['total'];
        $remajaPutriQuery['laki'] = 0;

        // Ibu Hamil (hanya total perempuan)
        $ibuHamilQuery = $this->db->table('tb_data_ibuhamil_surobayan')
            ->select('COUNT(id) as total')
            ->get()->getRowArray();
        $ibuHamilQuery['perempuan'] = $ibuHamilQuery['total'];
        $ibuHamilQuery['laki'] = 0;

        // Lansia
        $lansiaQuery = $this->db->table('tb_data_lansia_surobayan')
            ->select('COUNT(id) as total,
                      SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki,
                      SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan')
            ->get()->getRowArray();

        // Usia Produktif
        $usiaProduktifQuery = $this->db->table('tb_data_usia_produktif_surobayan')
            ->select('COUNT(id) as total,
                      SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki,
                      SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan')
            ->get()->getRowArray();
---
SELECT COUNT(id) as total, SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki, SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan
FROM `tb_data_balita2025_surobayan`
SELECT COUNT(id) as total
FROM `tb_data_remajaputri2025_surobayan`
SELECT COUNT(id) as total
FROM `tb_data_ibuhamil_surobayan`
SELECT COUNT(id) as total, SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki, SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan
FROM `tb_data_lansia_surobayan`
SELECT COUNT(id) as total, SUM(CASE WHEN jenis_kelamin = "L" THEN 1 ELSE 0 END) as laki, SUM(CASE WHEN jenis_kelamin = "P" THEN 1 ELSE 0 END) as perempuan
FROM `tb_data_usia_produktif_surobayan`