app/Models/PemantauanModel.php

    public function getBulanKosong()
    {
        $builder = $this->db->table('tb_pemantauan_balita2025new');
        $bulanList = $builder->select('bulan')->distinct()->get()->getResultArray();
---
SELECT DISTINCT `bulan`
FROM `tb_pemantauan_balita2025new`